#!/usr/bin/env bash
#
# nomeDoScript.sh - Breve Descrição
#
# Site:       https://seusite.com.br
# Autor:      Seu Nome.
# Manutenção: Seu Nome ou Outro.
#
# ------------------------------------------------------------------------ #
#  Aqui você deve utilizar uma descrição mais detalhada sobre o seu programa,
# explicando a forma de utilizar.
#
# Exemplos:
#      $ ./nomeDoScript.sh -d 1
#      Neste exemplo o script será executado no modo debug nível 1.
# ------------------------------------------------------------------------ #
# Histórico:
#
#   v1.0 04/10/2020, Autor da mudança:
#       - O que mudou?
#   v1.1 05/10/2020, Autor da mudança:
#       - O que mudou?
# ------------------------------------------------------------------------ #
# Testado em:
#   bash 5.0.18(1).
# ------------------------------------------------------------------------ #
# Agradecimentos:
#
# 	Joãozinho -  Encontrou um bug na parte de login.
#   Mariazinha - Enviou a sugestão de adicionar o -h.
# ------------------------------------------------------------------------ #

# ------------------------------- VARIÁVEIS ------------------------------ #

# ------------------------------------------------------------------------ #

# ------------------------------- TESTES --------------------------------- #

# ------------------------------------------------------------------------ #

# ------------------------------- FUNÇÕES -------------------------------- #

# ------------------------------------------------------------------------ #

# ------------------------------- EXECUÇÃO ------------------------------- #

# ------------------------------------------------------------------------ #
